---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarHandlesData
source: html/f1a4fb2f-9de2-ad00-1872-908ddc1e3f1a.htm
---
# RebarHandlesData Methods

Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.